In [1]:
import numpy as np
import pandas as pd
import scipy

In [2]:
cd C:\Users\QUYEN\Desktop\BA\Lap03

C:\Users\QUYEN\Desktop\BA\Lap03

In [3]:
pwd

u'C:\\Users\\QUYEN\\Desktop\\BA\\Lap03'

In [4]:
pd.read_csv('DSTT.csv')

     Nam  Tong So    Nam.1         Nu  Thanh_Thi  Nong_Thon
0   2000  38.5454  19.5487    18.9967     8.9103    29.6351
1   2001  39.6158  20.2079    19.4079     9.4759    30.1399
2   2002  40.7160  20.7189    19.9971     9.8485    30.8675
3   2003  41.8467  21.4497    20.3970    10.1042    31.7425
4   2004  43.0089  21.9483    21.0606    10.7030    32.3059
5   2005  44.9045  23.4931    21.4114    11.4614    33.4431
6   2006  46.2387  24.6139    21.6248    12.2663    33.9724
7   2007  47.1603  23.9457  2321.4600    12.4091    34.7512
8   2008  48.2096  24.7090    23.5006    13.1753    35.0343
9   2009  49.3220  25.6556    23.6664    13.2718    36.0502
10  2010  50.3929  25.8970    24.4959    14.1066    36.2863
11  2011  51.3984  26.4682    24.9302    15.2519    36.1465
12  2012  52.3480  26.9185    25.4295    15.8857    36.4623
13  2013  53.2456  27.3700    25.8750    16.0425    37.2031
14  2014  53.7480  27.5606    26.1874    16.5255    37.2225
15  2015  53.9842  27.8436    26.1406    16.9109    37.0733
16  2016  54.4453  28.0728    26.3725    17.4499    36.9954

In [5]:
x=pd.read_csv('DSTT.csv')
x.head()

    Nam  Tong So    Nam.1       Nu  Thanh_Thi  Nong_Thon
0  2000  38.5454  19.5487  18.9967     8.9103    29.6351
1  2001  39.6158  20.2079  19.4079     9.4759    30.1399
2  2002  40.7160  20.7189  19.9971     9.8485    30.8675
3  2003  41.8467  21.4497  20.3970    10.1042    31.7425
4  2004  43.0089  21.9483  21.0606    10.7030    32.3059

In [6]:
x.describe()

               Nam    Tong So      Nam.1           Nu  Thanh_Thi  Nong_Thon
count    17.000000  17.000000  17.000000    17.000000  17.000000  17.000000
mean   2008.000000  47.595900  24.495382   158.291388  13.164635  34.431265
std       5.049752   5.373597   2.839298   557.441677   2.817833   2.618176
min    2000.000000  38.545400  19.548700    18.996700   8.910300  29.635100
25%    2004.000000  43.008900  21.948300    21.060600  10.703000  32.305900
50%    2008.000000  48.209600  24.709000    23.666400  13.175300  35.034300
75%    2012.000000  52.348000  26.918500    25.875000  15.885700  36.462300
max    2016.000000  54.445300  28.072800  2321.460000  17.449900  37.222500

In [7]:
cyl=x['Thanh_Thi']
am=x['Nong_Thon']

In [8]:
am

0     29.6351
1     30.1399
2     30.8675
3     31.7425
4     32.3059
5     33.4431
6     33.9724
7     34.7512
8     35.0343
9     36.0502
10    36.2863
11    36.1465
12    36.4623
13    37.2031
14    37.2225
15    37.0733
16    36.9954
Name: Nong_Thon, dtype: float64

In [9]:
x.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 17 entries, 0 to 16
Data columns (total 6 columns):
Nam          17 non-null int64
Tong So      17 non-null float64
Nam.1        17 non-null float64
Nu           17 non-null float64
Thanh_Thi    17 non-null float64
Nong_Thon    17 non-null float64
dtypes: float64(5), int64(1)
memory usage: 888.0 bytes

In [10]:
from scipy import stats
stats.ttest_1samp(cyl, 2)

Ttest_1sampResult(statistic=16.336301883337878, pvalue=2.1111164541293372e-11)

In [11]:
stats.f_oneway(cyl,am)

F_onewayResult(statistic=519.6733189161812, pvalue=2.364031164690609e-21)

In [12]:
x.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 17 entries, 0 to 16
Data columns (total 6 columns):
Nam          17 non-null int64
Tong So      17 non-null float64
Nam.1        17 non-null float64
Nu           17 non-null float64
Thanh_Thi    17 non-null float64
Nong_Thon    17 non-null float64
dtypes: float64(5), int64(1)
memory usage: 888.0 bytes

In [13]:
x.columns

Index([u'Nam', u'Tong So', u'Nam.1', u'Nu', u'Thanh_Thi', u'Nong_Thon'], dtype='object')

In [14]:
import pandas as pd
import statsmodels.api as sm
from statsmodels.formula.api import ols
cw = pd.read_csv('DSTT.csv')
cw_lm=ols('Thanh_Thi ~ Nong_Thon', data=cw).fit() #Specify C for Categorical
print(sm.stats.anova_lm(cw_lm, typ=2))

C:\Users\QUYEN\Anaconda2\lib\site-packages\statsmodels\compat\pandas.py:56: FutureWarning: The pandas.core.datetools module is deprecated and will be removed in a future version. Please use the pandas.tseries module instead.
  from pandas.core import datetools

               sum_sq    df           F        PR(>F)
Nong_Thon  115.690861   1.0  152.867613  2.870410e-09
Residual    11.352064  15.0         NaN           NaN